app/views/blogs/_info.html.erb

SELECT `messages`.* FROM `messages` WHERE (`messages`.blog_id = 10)
UPDATE `blogs` SET `r_number` = 10, `updated_at` = '2011-11-27 08:12:41' WHERE `blogs`.`id` = 10
---
<div class="read"><div id="date">更新日期：<%= format_time(info.updated_at)%>&nbsp;&nbsp;<%= info.r_number %>人阅读</div><a href="/blogs/<%= info.id%>#comment">评论(<%= info.messages.length%>)</a></div>