app/controllers/admin/admins_controller.rb

  def get_admins
    admins = Admin.all
    render :text => get_json(Admin.count,admins.to_json),:layout => false
---
SELECT `admins`.* FROM `admins`
SELECT COUNT(*) FROM `admins`

  def create
    admin = Admin.new(params[:admin])
    result = get_result(admin.save ? 'success' : admin.errors.to_s)
---
INSERT INTO `admins` (`password`, `updated_at`, `user_name`, `created_at`) VALUES ('222', '2011-09-05 15:37:22', '222', '2011-09-05 15:37:22')

  def update
    admin = Admin.find params[:id]
    if admin.update_attributes(params[:admin])
---
SELECT `admins`.* FROM `admins` WHERE `admins`.`id` = 1 LIMIT 1
UPDATE `admins` SET `updated_at` = '2011-09-05 15:47:07', `password` = 'gsy19861' WHERE `admins`.`id` = 1

  def edit
    begin
      render :text => Admin.find(params[:id]).to_json,:layout => false
---
SELECT `admins`.* FROM `admins` WHERE `admins`.`id` = 1 LIMIT 1

  def destroy_list
    begin
      ids = params[:id][1..params[:id].length-2].split(',')
      Admin.destroy(ids)
---
DELETE FROM `admins` WHERE `admins`.`id` = 2