app/controllers/admin/blogs_controller.rb

  def get_blogs
    blogs = Blog.order('created_at DESC').offset(params[:start].to_i).limit(params[:limit].to_i)
    render :text => get_json(Blog.count,blogs.to_json(:except => [:content])),:layout => false
---
SELECT `blogs`.* FROM `blogs` ORDER BY created_at DESC LIMIT 0 OFFSET 0
SELECT COUNT(*) FROM `blogs`

  def create
    blog = Blog.new(params[:blog])
    if blog.save
---
INSERT INTO `blogs` (`updated_at`, `tag_name`, `created_at`, `title`, `number`, `content`) VALUES ('2011-09-05 16:23:12', '222,1123', '2011-09-05 16:23:12', '222', 0, '123123123<br />')

  def update
    blog = Blog.find params[:id]
    if blog.update_attributes(params[:blog])
---
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 11 LIMIT 1
UPDATE `blogs` SET `tag_name` = '111,222', `updated_at` = '2011-09-05 15:15:16' WHERE `blogs`.`id` = 11

  def edit
    begin
      render :text => Blog.find(params[:id]).to_json,:layout => false
---
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 10 LIMIT 1

  def destroy_list
    begin
      ids = params[:id][1..params[:id].length-2].split(',')
      Blog.destroy(ids)
---
DELETE FROM `blogs` WHERE `blogs`.`id` = 10

  def get_tags
    tags = Tag.offset(params[:start].to_i).limit(params[:limit].to_i)
    render :text => get_json(Tag.count,tags.to_json),:layout => false
---
SELECT `tags`.* FROM `tags` LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM `tags`

  def destroy_tags
    begin
      ids = params[:id][1..params[:id].length-2].split(',')
      Tag.destroy(ids)
---
DELETE FROM `tags` WHERE `tags`.`id` = 17