app/controllers/admin/messages_controller.rb

  def get_messages
    messages = Message.board.offset(params[:start].to_i).limit(params[:limit].to_i)
    render :text => get_json(Message.count,messages.to_json),:layout => false
---
SELECT `messages`.* FROM `messages` WHERE (blog_id is null) ORDER BY created_at DESC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM `messages`

  def get_messages_with_blog
    messages = Message.where('blog_id = ?',params[:blog_id] || 0).order('created_at DESC').offset(params[:start].to_i).limit(params[:limit].to_i)
    render :text => get_json(Message.count,messages.to_json),:layout => false
---
SELECT `messages`.* FROM `messages` WHERE (blog_id = 0) ORDER BY created_at DESC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM `messages`
SELECT `messages`.* FROM `messages` WHERE (blog_id = 0) LIMIT 20 OFFSET 0

  def create
    message = Message.new(params[:message])
    result = get_result(message.save ? 'success' : message.errors.to_s)
---
INSERT INTO `messages` (`updated_at`, `blog_id`, `created_at`, `url`, `email`, `content`, `name`) VALUES ('2011-09-05 14:43:00', NULL, '2011-09-05 14:43:00', 'http://www.kimigao.me', 'gaoshengyang2000@163.com', '1111<br />', '111')

  def update
    message = Message.find params[:id]
    if message.update_attributes(params[:message])
---
SELECT `messages`.* FROM `messages` WHERE `messages`.`id` = 9 LIMIT 1
UPDATE `messages` SET `updated_at` = '2011-09-05 15:19:56', `content` = '2222333333<br />', `name` = '1113' WHERE `messages`.`id` = 10

  def edit
    begin
      render :text => Message.find(params[:id]).to_json,:layout => false
---
SELECT `messages`.* FROM `messages` WHERE `messages`.`id` = 6 LIMIT 1

  def destroy_list
    begin
      ids = params[:id][1..params[:id].length-2].split(',')
      Message.destroy(ids)
---
DELETE FROM `messages` WHERE `messages`.`id` = 7