app/controllers/about_controller.rb

  def index
    @about = Aboutme.first
---
SELECT `aboutmes`.* FROM `aboutmes` LIMIT 1