app/controllers/blogs_controller.rb

  def blogs_list
    @blogs = Blog.all
---
SELECT `blogs`.* FROM `blogs`

  def index
    @tag = params[:tag]

    @blogs = Blog.where('tag_name like ?','%'+params[:tag].to_s+'%').order('updated_at DESC').paginate(:page => params[:page]||1,:per_page => 50)
---
SELECT `blogs`.* FROM `blogs` WHERE (tag_name like '%%') ORDER BY updated_at DESC

  def show
    @blog = Blog.find(params[:id])
---
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 9 LIMIT 1

  def comment
    @message = Message.new(params[:message])

    respond_to do |format|
      if @message.save
---
INSERT INTO `messages` (`blog_id`, `name`, `email`, `url`, `created_at`, `content`, `updated_at`) VALUES (9, '2222', 'gaoshengyang2000@163.com', '', '2011-09-05 16:21:38', 'ddddddd', '2011-09-05 16:21:38')