app/controllers/home_controller.rb

  def index
    @blogs = Blog.order('created_at DESC').paginate(:page => params[:page]||1,:per_page => 5)
---
SELECT `blogs`.* FROM `blogs` ORDER BY created_at DESC LIMIT 10