app/controllers/messages_controller.rb

SELECT `messages`.* FROM `messages` WHERE (blog_id is null) ORDER BY created_at DESC
---
  def index
    @messages = Message.find_messages_without_blog

INSERT INTO `messages` (`email`, `updated_at`, `blog_id`, `name`, `url`, `content`, `created_at`) VALUES ('222@163.com', '2011-09-05 16:22:13', NULL, '2222', '', 'eeeee', '2011-09-05 16:22:13')
---
  def comment
    @message = Message.new(params[:message])

    respond_to do |format|
      if @message.save