app/controllers/messages_controller.rb

SELECT `messages`.* FROM `messages`
---
  def messages_list
    @messages = Message.all